{
  "questions": [
    {
      "id": "WebQTrn-129",
      "question": [
        {
          "language": "en",
          "string": "who is the current president of the dominican republic?",
          "keywords": ""
        }
      ],
      "query": {
        "sparql": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?x WHERE { wd:Q786 wdt:P6 ?x. }"
      }
    },
    {
      "id": "WebQTrn-248",
      "question": [
        {
          "language": "en",
          "string": "who started pixar?",
          "keywords": ""
        }
      ],
      "query": {
        "sparql": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?x WHERE { wd:Q127552 wdt:P112 ?x. }"
      }
    },
    {
      "id": "WebQTrn-277",
      "question": [
        {
          "language": "en",
          "string": "who did hera marry?",
          "keywords": ""
        }
      ],
      "query": {
        "sparql": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?x WHERE { wd:Q38012 wdt:P26 ?x. }"
      }
    },
    {
      "id": "WebQTrn-376",
      "question": [
        {
          "language": "en",
          "string": "who speaks farsi?",
          "keywords": ""
        }
      ],
      "query": {
        "sparql": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?x WHERE { ?x wdt:P37 wd:Q9168; wdt:P31/wdt:P279* wd:Q6256. }"
      }
    },
    {
      "id": "WebQTrn-426",
      "question": [
        {
          "language": "en",
          "string": "who was louis riel?",
          "keywords": ""
        }
      ],
      "query": {
        "sparql": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?x WHERE { wd:Q313691 wdt:P106 ?x. }"
      }
    },
    {
      "id": "WebQTrn-473",
      "question": [
        {
          "language": "en",
          "string": "who's kobe bryant?",
          "keywords": ""
        }
      ],
      "query": {
        "sparql": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?x WHERE { wd:Q25369 wdt:P106 ?x. }"
      }
    },
    {
      "id": "WebQTrn-605",
      "question": [
        {
          "language": "en",
          "string": "who was tex beneke?",
          "keywords": ""
        }
      ],
      "query": {
        "sparql": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?x WHERE { wd:Q488352 wdt:P106 ?x. }"
      }
    },
    {
      "id": "WebQTrn-792",
      "question": [
        {
          "language": "en",
          "string": "who owns skywest?",
          "keywords": ""
        }
      ],
      "query": {
        "sparql": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?x WHERE { wd:Q773662 wdt:P749 ?x. }"
      }
    },
    {
      "id": "WebQTrn-908",
      "question": [
        {
          "language": "en",
          "string": "who is james dean?",
          "keywords": ""
        }
      ],
      "query": {
        "sparql": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?x WHERE { wd:Q83359 wdt:P106 ?x. }"
      }
    },
    {
      "id": "WebQTrn-973",
      "question": [
        {
          "language": "en",
          "string": "who was dan cody?",
          "keywords": ""
        }
      ],
      "query": {
        "sparql": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?x WHERE { wd:Q5213273 wdt:P106 ?x. }"
      }
    },
    {
      "id": "WebQTrn-1013",
      "question": [
        {
          "language": "en",
          "string": "who is aidan davis?",
          "keywords": ""
        }
      ],
      "query": {
        "sparql": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?x WHERE { wd:Q4696678 wdt:P106 ?x. }"
      }
    },
    {
      "id": "WebQTrn-1240",
      "question": [
        {
          "language": "en",
          "string": "where is mallorca?",
          "keywords": ""
        }
      ],
      "query": {
        "sparql": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?x WHERE { wd:Q8828 wdt:P206 ?x. }"
      }
    },
    {
      "id": "WebQTrn-1384",
      "question": [
        {
          "language": "en",
          "string": "who was louis xvi?",
          "keywords": ""
        }
      ],
      "query": {
        "sparql": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wikibase: <http://wikiba.se/ontology#> PREFIX bd: <http://www.bigdata.com/rdf#> PREFIX schema: <http://schema.org/> SELECT DISTINCT ?x WHERE { SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". wd:Q7732 schema:description ?x. } }"
      }
    },
    {
      "id": "WebQTrn-1610",
      "question": [
        {
          "language": "en",
          "string": "who does cristiano ronaldo play for now?",
          "keywords": ""
        }
      ],
      "query": {
        "sparql": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?x WHERE { wd:Q11571 wdt:P54 ?x. }"
      }
    },
    {
      "id": "WebQTrn-1948",
      "question": [
        {
          "language": "en",
          "string": "who is the current president of china?",
          "keywords": ""
        }
      ],
      "query": {
        "sparql": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?x WHERE { wd:Q148 wdt:P35 ?x. }"
      }
    },
    {
      "id": "WebQTrn-1979",
      "question": [
        {
          "language": "en",
          "string": "who's betty white?",
          "keywords": ""
        }
      ],
      "query": {
        "sparql": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?x WHERE { wd:Q373895 wdt:P106 ?x. }"
      }
    },
    {
      "id": "WebQTrn-1992",
      "question": [
        {
          "language": "en",
          "string": "who shot j lennon?",
          "keywords": ""
        }
      ],
      "query": {
        "sparql": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?x WHERE { wd:Q1203 wdt:P157 ?x. }"
      }
    },
    {
      "id": "WebQTrn-2016",
      "question": [
        {
          "language": "en",
          "string": "where does selena gomez live right now?",
          "keywords": ""
        }
      ],
      "query": {
        "sparql": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?x WHERE { wd:Q83287 wdt:P551 ?x. }"
      }
    },
    {
      "id": "WebQTrn-2240",
      "question": [
        {
          "language": "en",
          "string": "who is the current president of dominican republic?",
          "keywords": ""
        }
      ],
      "query": {
        "sparql": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?x WHERE { wd:Q786 wdt:P6 ?x. }"
      }
    },
    {
      "id": "WebQTrn-2393",
      "question": [
        {
          "language": "en",
          "string": "who started google?",
          "keywords": ""
        }
      ],
      "query": {
        "sparql": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?x WHERE { wd:Q9366 wdt:P112 ?x. }"
      }
    },
    {
      "id": "WebQTrn-2418",
      "question": [
        {
          "language": "en",
          "string": "who does allen iverson play for now?",
          "keywords": ""
        }
      ],
      "query": {
        "sparql": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?x WHERE { wd:Q190094 wdt:P54 ?x. }"
      }
    },
    {
      "id": "WebQTrn-2428",
      "question": [
        {
          "language": "en",
          "string": "who is john garcia?",
          "keywords": ""
        }
      ],
      "query": {
        "sparql": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?x WHERE { wd:Q918849 wdt:P106 ?x. }"
      }
    },
    {
      "id": "WebQTrn-2587",
      "question": [
        {
          "language": "en",
          "string": "who is the current governor of georgia?",
          "keywords": ""
        }
      ],
      "query": {
        "sparql": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?x WHERE { wd:Q739 wdt:P6 ?x. }"
      }
    },
    {
      "id": "WebQTrn-2642",
      "question": [
        {
          "language": "en",
          "string": "who is the current president of chile?",
          "keywords": ""
        }
      ],
      "query": {
        "sparql": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?x WHERE { wd:Q298 wdt:P6 ?x. }"
      }
    },
    {
      "id": "WebQTrn-2674",
      "question": [
        {
          "language": "en",
          "string": "where is usc from?",
          "keywords": ""
        }
      ],
      "query": {
        "sparql": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?x WHERE { wd:Q1024426 wdt:P131 ?x. }"
      }
    },
    {
      "id": "WebQTrn-2830",
      "question": [
        {
          "language": "en",
          "string": "where is madeira?",
          "keywords": ""
        }
      ],
      "query": {
        "sparql": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?x WHERE { wd:Q26253 wdt:P131 ?x. }"
      }
    },
    {
      "id": "WebQTrn-2865",
      "question": [
        {
          "language": "en",
          "string": "where is bosnia?",
          "keywords": ""
        }
      ],
      "query": {
        "sparql": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?x WHERE { wd:Q225 wdt:P30 ?x. }"
      }
    },
    {
      "id": "WebQTrn-3094",
      "question": [
        {
          "language": "en",
          "string": "who is aidan quinn?",
          "keywords": ""
        }
      ],
      "query": {
        "sparql": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?x WHERE { wd:Q403902 wdt:P106 ?x. }"
      }
    },
    {
      "id": "WebQTrn-3125",
      "question": [
        {
          "language": "en",
          "string": "what city uses gmt?",
          "keywords": ""
        }
      ],
      "query": {
        "sparql": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?x WHERE { ?x wdt:P421 wd:Q30192; wdt:P31 wd:Q515. }"
      }
    },
    {
      "id": "WebQTrn-3143",
      "question": [
        {
          "language": "en",
          "string": "who owns audi 2011?",
          "keywords": ""
        }
      ],
      "query": {
        "sparql": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?x WHERE { ?y wdt:P355 wd:Q23317; wdt:P127 ?x. }"
      }
    },
    {
      "id": "WebQTrn-3158",
      "question": [
        {
          "language": "en",
          "string": "what boudicca do?",
          "keywords": ""
        }
      ],
      "query": {
        "sparql": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?x WHERE { wd:Q184634 wdt:P39 ?x. }"
      }
    },
    {
      "id": "WebQTrn-3586",
      "question": [
        {
          "language": "en",
          "string": "what nestle owns?",
          "keywords": ""
        }
      ],
      "query": {
        "sparql": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?x WHERE { wd:Q160746 wdt:P355 ?x. }"
      }
    },
    {
      "id": "WebQTrn-3612",
      "question": [
        {
          "language": "en",
          "string": "what is kate spade?",
          "keywords": ""
        }
      ],
      "query": {
        "sparql": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?x WHERE { wd:Q275094 wdt:P106 ?x. }"
      }
    }
  ]
}